app/controllers/categories_controller.rb

INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 05 Feb 2014 01:23:24 UTC +00:00], ["name", "Meeting"], ["updated_at", Wed, 05 Feb 2014 01:23:24 UTC +00:00]]
---
  def create
    @category = Category.new(category_params)

    if @category.save

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @category = Category.find(params[:id])