app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(comment_params) #build does not hit the database
    @comment.user = User.first

    if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "this is not a game"], ["created_at", Wed, 05 Feb 2014 14:31:56 UTC +00:00], ["post_id", 2], ["updated_at", Wed, 05 Feb 2014 14:31:56 UTC +00:00], ["user_id", 2]]