app/controllers/posts_controller.rb

  def index
    @posts = Post.all.sort_by{|x| x.total_votes}.reverse
---
SELECT "posts".* FROM "posts"

  def create
    @post = Post.new(post_params)
    @post.user = current_user

    if @post.save
---
INSERT INTO "posts" ("created_at", "description", "title", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?, ?)

  def update

    if @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["title", "Work again"], ["updated_at", Tue, 04 Feb 2014 03:35:40 UTC +00:00]]

  def vote
    @vote = Vote.create(voteable: @post, user: current_user, vote: params[:vote])
---
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Thu, 13 Feb 2014 01:43:27 UTC +00:00], ["updated_at", Thu, 13 Feb 2014 01:43:27 UTC +00:00], ["user_id", 3], ["vote", true], ["voteable_id", 2], ["voteable_type", "Post"]]