app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user = User.first
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]