app/controllers/users_controller.rb

INSERT INTO "users" ("password_digest", "username") VALUES (?, ?)  [["password_digest", "$2a$10$GBWcnR5rHz4UoIrITfNoF.JGDcNgzAVLjv9vq5h2n/gasr3mN3PT."], ["username", "ninjuluw"]]
---
  def create
    @user = User.new(user_params)

    if @user.save

UPDATE "users" SET "username" = ?, "password_digest" = ? WHERE "users"."id" = 2  [["username", "Marvee "], ["password_digest", "$2a$10$EL0RNw7yG20drUM5.zZV9uCJbmu/1mcWuJMsImXE52zHXNLOL.fh2"]]
---
  def update
    if @user.update(user_params)